// 所有期间的数据
const DATA_STORAGE = {
    "1A": {
        "period": "1A",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 1673000,
                "尤菲亚2": 1012500,
                "尤菲亚3": 2020000,
                "纳达卡1": 1142400,
                "纳达卡2": 211500,
                "纳达卡3": 100800,
                "尼赫鲁1": 828000,
                "尼赫鲁2": 727650,
                "尼赫鲁3": 88200
            },
            "整个行业收入（百万）": {
                "尤菲亚1": null,
                "尤菲亚2": null,
                "尤菲亚3": null,
                "纳达卡1": null,
                "纳达卡2": null,
                "纳达卡3": null,
                "尼赫鲁1": null,
                "尼赫鲁2": null,
                "尼赫鲁3": null
            },
            "平均行业毛利率": {
                "尤菲亚1": null,
                "尤菲亚2": null,
                "尤菲亚3": null,
                "纳达卡1": null,
                "纳达卡2": null,
                "纳达卡3": null,
                "尼赫鲁1": null,
                "尼赫鲁2": null,
                "尼赫鲁3": null
            },
            "最低期末库存成本": {
                "尤菲亚1": null,
                "尤菲亚2": null,
                "尤菲亚3": null,
                "纳达卡1": null,
                "纳达卡2": null,
                "纳达卡3": null,
                "尼赫鲁1": null,
                "尼赫鲁2": null,
                "尼赫鲁3": null
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 27,
                "尤菲亚P2": 14,
                "尤菲亚P3": 20,
                "纳达卡P1": 26,
                "纳达卡P2": 14,
                "纳达卡P3": 20,
                "尼赫鲁P1": 15,
                "尼赫鲁P2": 27,
                "尼赫鲁P3": 19
            },
            "2": {
                "尤菲亚P1": 26,
                "尤菲亚P2": 22,
                "尤菲亚P3": 10,
                "纳达卡P1": 23,
                "纳达卡P2": 23,
                "纳达卡P3": 21,
                "尼赫鲁P1": 21,
                "尼赫鲁P2": 19,
                "尼赫鲁P3": 22
            },
            "3": {
                "尤菲亚P1": 24,
                "尤菲亚P2": 12,
                "尤菲亚P3": 20,
                "纳达卡P1": 26,
                "纳达卡P2": 12,
                "纳达卡P3": 20,
                "尼赫鲁P1": 15,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 19
            },
            "4": {
                "尤菲亚P1": 12,
                "尤菲亚P2": 29,
                "尤菲亚P3": 26,
                "纳达卡P1": 12,
                "纳达卡P2": 28,
                "纳达卡P3": 20,
                "尼赫鲁P1": 28,
                "尼赫鲁P2": 10,
                "尼赫鲁P3": 19
            },
            "5": {
                "尤菲亚P1": 12,
                "尤菲亚P2": 22,
                "尤菲亚P3": 25,
                "纳达卡P1": 14,
                "纳达卡P2": 23,
                "纳达卡P3": 20,
                "尼赫鲁P1": 21,
                "尼赫鲁P2": 19,
                "尼赫鲁P3": 19
            }
        },
        "marketPricing": {
            "1": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 26,
                "尤菲亚P3": 32,
                "纳达卡P1": 40,
                "纳达卡P2": 26,
                "纳达卡P3": 32,
                "尼赫鲁P1": 40,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 32
            },
            "2": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 26,
                "尤菲亚P3": 32,
                "纳达卡P1": 40,
                "纳达卡P2": 26,
                "纳达卡P3": 32,
                "尼赫鲁P1": 40,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 32
            },
            "3": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 26,
                "尤菲亚P3": 32,
                "纳达卡P1": 40,
                "纳达卡P2": 26,
                "纳达卡P3": 32,
                "尼赫鲁P1": 40,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 32
            },
            "4": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 26,
                "尤菲亚P3": 32,
                "纳达卡P1": 40,
                "纳达卡P2": 26,
                "纳达卡P3": 32,
                "尼赫鲁P1": 40,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 32
            },
            "5": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 26,
                "尤菲亚P3": 32,
                "纳达卡P1": 40,
                "纳达卡P2": 26,
                "纳达卡P3": 32,
                "尼赫鲁P1": 40,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 32
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 4.36, "电阻": 3.77 },
                "雷墨磁2": { "扭矩": 2.46, "电阻": 2.32 },
                "雷墨磁3": { "扭矩": 1.85, "电阻": 3.50 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 4.03, "电阻": 4.29 },
                "雷墨磁2": { "扭矩": 2.57, "电阻": 2.55 },
                "雷墨磁3": { "扭矩": 1.10, "电阻": 1.51 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 4.07, "电阻": 2.20 },
                "雷墨磁2": { "扭矩": 3.52, "电阻": 2.58 },
                "雷墨磁3": { "扭矩": 4.40, "电阻": 1.47 }
            }
        },
        "teamCoordinates": {
            "1": {
                "雷墨磁1": { "扭矩": 4.2, "电阻": 3.9, "目标市场": "尤1", "偏离度": 0.20 },
                "雷墨磁2": { "扭矩": 3.5, "电阻": 2.7, "目标市场": "尼2", "偏离度": 0.12 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.35 }
            },
            "2": {
                "雷墨磁1": { "扭矩": 4.1, "电阻": 3.5, "目标市场": "尤1", "偏离度": 0.37 },
                "雷墨磁2": { "扭矩": 3.0, "电阻": 2.6, "目标市场": "纳2", "偏离度": 0.61 },
                "雷墨磁3": { "扭矩": 2.5, "电阻": 2.5, "目标市场": "尤3", "偏离度": 1.19 }
            },
            "3": {
                "雷墨磁1": { "扭矩": 3.8, "电阻": 3.8, "目标市场": "纳1", "偏离度": 0.54 },
                "雷墨磁2": { "扭矩": 3.7, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.28 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.35 }
            },
            "4": {
                "雷墨磁1": { "扭矩": 4.0, "电阻": 2.2, "目标市场": "尼1", "偏离度": 0.07 },
                "雷墨磁2": { "扭矩": 2.5, "电阻": 2.4, "目标市场": "尤2", "偏离度": 0.09 },
                "雷墨磁3": { "扭矩": 1.9, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "5": {
                "雷墨磁1": { "扭矩": 3.0, "电阻": 3.0, "目标市场": "无", "偏离度": null },
                "雷墨磁2": { "扭矩": 3.0, "电阻": 2.7, "目标市场": "纳2", "偏离度": 0.66 },
                "雷墨磁3": { "扭矩": 2.0, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.15 }
            }
        }
    },
    "1B": {
        "period": "1B",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 2102310,
                "尤菲亚2": 1055700,
                "尤菲亚3": 2307820,
                "纳达卡1": 1201872,
                "纳达卡2": 213863,
                "纳达卡3": 91865,
                "尼赫鲁1": 409785,
                "尼赫鲁2": 725646,
                "尼赫鲁3": 68203
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 68.0,
                "尤菲亚2": 25.4,
                "尤菲亚3": 68.9,
                "纳达卡1": 42.1,
                "纳达卡2": 5.8,
                "纳达卡3": 3.6,
                "尼赫鲁1": 19.1,
                "尼赫鲁2": 20.1,
                "尼赫鲁3": 2.6
            },
            "平均行业毛利率": {
                "尤菲亚1": 29,
                "尤菲亚2": 41,
                "尤菲亚3": 22,
                "纳达卡1": 20,
                "纳达卡2": 29,
                "纳达卡3": 23,
                "尼赫鲁1": 36,
                "尼赫鲁2": 38,
                "尼赫鲁3": 28
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 11.20,
                "尤菲亚3": 17.85,
                "纳达卡1": 29.57,
                "纳达卡2": 14.78,
                "纳达卡3": 23.56,
                "尼赫鲁1": 26.43,
                "尼赫鲁2": 13.22,
                "尼赫鲁3": 21.06
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 24,
                "尤菲亚P2": 14,
                "尤菲亚P3": 19,
                "纳达卡P1": 28,
                "纳达卡P2": 14,
                "纳达卡P3": 23,
                "尼赫鲁P1": 23,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 23
            },
            "2": {
                "尤菲亚P1": 25,
                "尤菲亚P2": 23,
                "尤菲亚P3": 10,
                "纳达卡P1": 27,
                "纳达卡P2": 25,
                "纳达卡P3": 20,
                "尼赫鲁P1": 32,
                "尼赫鲁P2": 21,
                "尼赫鲁P3": 22
            },
            "3": {
                "尤菲亚P1": 28,
                "尤菲亚P2": 11,
                "尤菲亚P3": 22,
                "纳达卡P1": 30,
                "纳达卡P2": 12,
                "纳达卡P3": 22,
                "尼赫鲁P1": 23,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 23
            },
            "4": {
                "尤菲亚P1": 12,
                "尤菲亚P2": 29,
                "尤菲亚P3": 25,
                "纳达卡P1": 14,
                "纳达卡P2": 25,
                "纳达卡P3": 22,
                "尼赫鲁P1": 17,
                "尼赫鲁P2": 11,
                "尼赫鲁P3": 21
            },
            "5": {
                "尤菲亚P1": 11,
                "尤菲亚P2": 23,
                "尤菲亚P3": 25,
                "纳达卡P1": 2,
                "纳达卡P2": 24,
                "纳达卡P3": 13,
                "尼赫鲁P1": 5,
                "尼赫鲁P2": 19,
                "尼赫鲁P3": 11
            }
        },
        "marketPricing": {
            "1": {
                "尤菲亚P1": 38,
                "尤菲亚P2": 21,
                "尤菲亚P3": 31,
                "纳达卡P1": 39,
                "纳达卡P2": 26,
                "纳达卡P3": 33,
                "尼赫鲁P1": 46,
                "尼赫鲁P2": 35,
                "尼赫鲁P3": 33
            },
            "2": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 23,
                "尤菲亚P3": 29,
                "纳达卡P1": 36,
                "纳达卡P2": 23,
                "纳达卡P3": 44,
                "尼赫鲁P1": 36,
                "尼赫鲁P2": 23,
                "尼赫鲁P3": 40
            },
            "3": {
                "尤菲亚P1": 32,
                "尤菲亚P2": 28,
                "尤菲亚P3": 28,
                "纳达卡P1": 37,
                "纳达卡P2": 28,
                "纳达卡P3": 32,
                "尼赫鲁P1": 46,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 32
            },
            "4": {
                "尤菲亚P1": 39,
                "尤菲亚P2": 25,
                "尤菲亚P3": 31,
                "纳达卡P1": 49,
                "纳达卡P2": 33,
                "纳达卡P3": 39,
                "尼赫鲁P1": 79,
                "尼赫鲁P2": 29,
                "尼赫鲁P3": 39
            },
            "5": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 25,
                "尤菲亚P3": 30,
                "纳达卡P1": 55,
                "纳达卡P2": 26,
                "纳达卡P3": 60,
                "尼赫鲁P1": 50,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 52
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 4.36, "电阻": 3.77 },
                "雷墨磁2": { "扭矩": 2.46, "电阻": 2.32 },
                "雷墨磁3": { "扭矩": 1.85, "电阻": 3.50 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 4.03, "电阻": 4.29 },
                "雷墨磁2": { "扭矩": 2.57, "电阻": 2.55 },
                "雷墨磁3": { "扭矩": 1.10, "电阻": 1.49 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 4.07, "电阻": 2.20 },
                "雷墨磁2": { "扭矩": 3.52, "电阻": 2.58 },
                "雷墨磁3": { "扭矩": 4.40, "电阻": 1.47 }
            }
        },
        "teamCoordinates": {
            "1": {
                "雷墨磁1": { "扭矩": 4.2, "电阻": 3.9, "目标市场": "尤1", "偏离度": 0.20 },
                "雷墨磁2": { "扭矩": 3.5, "电阻": 2.7, "目标市场": "尼2", "偏离度": 0.12 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.35 }
            },
            "2": {
                "雷墨磁1": { "扭矩": 4.1, "电阻": 3.5, "目标市场": "尤1", "偏离度": 0.37 },
                "雷墨磁2": { "扭矩": 3.0, "电阻": 2.6, "目标市场": "纳2", "偏离度": 0.61 },
                "雷墨磁3": { "扭矩": 2.5, "电阻": 2.5, "目标市场": "尤3", "偏离度": 1.20 }
            },
            "3": {
                "雷墨磁1": { "扭矩": 3.8, "电阻": 3.8, "目标市场": "纳1", "偏离度": 0.54 },
                "雷墨磁2": { "扭矩": 3.7, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.28 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.35 }
            },
            "4": {
                "雷墨磁1": { "扭矩": 4.0, "电阻": 2.2, "目标市场": "尼1", "偏离度": 0.07 },
                "雷墨磁2": { "扭矩": 2.5, "电阻": 2.4, "目标市场": "尤2", "偏离度": 0.09 },
                "雷墨磁3": { "扭矩": 1.9, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "5": {
                "雷墨磁1": { "扭矩": 3.0, "电阻": 3.0, "目标市场": "无", "偏离度": null },
                "雷墨磁2": { "扭矩": 3.0, "电阻": 2.7, "目标市场": "纳2", "偏离度": 0.66 },
                "雷墨磁3": { "扭矩": 2.0, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.15 }
            }
        }
    },
    "2": {
        "period": "2",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 1326849,
                "尤菲亚2": 1343565,
                "尤菲亚3": 2378884,
                "纳达卡1": 779711,
                "纳达卡2": 183455,
                "纳达卡3": 16758,
                "尼赫鲁1": 1255561,
                "尼赫鲁2": 983768,
                "尼赫鲁3": 70430
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 49.0,
                "尤菲亚2": 32.6,
                "尤菲亚3": 74.7,
                "纳达卡1": 31.0,
                "纳达卡2": 4.7,
                "纳达卡3": 0.7,
                "尼赫鲁1": 62.6,
                "尼赫鲁2": 29.2,
                "尼赫鲁3": 2.7
            },
            "平均行业毛利率": {
                "尤菲亚1": 37,
                "尤菲亚2": 57,
                "尤菲亚3": 28,
                "纳达卡1": 32,
                "纳达卡2": 44,
                "纳达卡3": 41,
                "尼赫鲁1": 45,
                "尼赫鲁2": 53,
                "尼赫鲁3": 37
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 9.22,
                "尤菲亚3": 16.91,
                "纳达卡1": 22.34,
                "纳达卡2": 13.12,
                "纳达卡3": 17.81,
                "尼赫鲁1": 26.43,
                "尼赫鲁2": 8.70,
                "尼赫鲁3": 19.49
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 24,
                "尤菲亚P2": 16,
                "尤菲亚P3": 25,
                "纳达卡P1": 33,
                "纳达卡P2": 14,
                "纳达卡P3": 37,
                "尼赫鲁P1": 16,
                "尼赫鲁P2": 27,
                "尼赫鲁P3": 23
            },
            "2": {
                "尤菲亚P1": 28,
                "尤菲亚P2": 19,
                "尤菲亚P3": 6,
                "纳达卡P1": 21,
                "纳达卡P2": 32,
                "纳达卡P3": 13,
                "尼赫鲁P1": 13,
                "尼赫鲁P2": 10,
                "尼赫鲁P3": 11
            },
            "3": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 3,
                "尤菲亚P3": 26,
                "纳达卡P1": 33,
                "纳达卡P2": 5,
                "纳达卡P3": 19,
                "尼赫鲁P1": 11,
                "尼赫鲁P2": 22,
                "尼赫鲁P3": 25
            },
            "4": {
                "尤菲亚P1": 5,
                "尤菲亚P2": 40,
                "尤菲亚P3": 29,
                "纳达卡P1": 10,
                "纳达卡P2": 41,
                "纳达卡P3": 19,
                "尼赫鲁P1": 35,
                "尼赫鲁P2": 7,
                "尼赫鲁P3": 28
            },
            "5": {
                "尤菲亚P1": 7,
                "尤菲亚P2": 22,
                "尤菲亚P3": 13,
                "纳达卡P1": 2,
                "纳达卡P2": 8,
                "纳达卡P3": 12,
                "尼赫鲁P1": 26,
                "尼赫鲁P2": 33,
                "尼赫鲁P3": 12
            }
        },
        "marketPricing": {
            "1": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 21,
                "尤菲亚P3": 31,
                "纳达卡P1": 39,
                "纳达卡P2": 26,
                "纳达卡P3": 33,
                "尼赫鲁P1": 46,
                "尼赫鲁P2": 33,
                "尼赫鲁P3": 33
            },
            "2": {
                "尤菲亚P1": 39,
                "尤菲亚P2": 25,
                "尤菲亚P3": 44,
                "纳达卡P1": 42,
                "纳达卡P2": 28,
                "纳达卡P3": 58,
                "尼赫鲁P1": 40,
                "尼赫鲁P2": 27,
                "尼赫鲁P3": 52
            },
            "3": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 45,
                "尤菲亚P3": 30,
                "纳达卡P1": 39,
                "纳达卡P2": 30,
                "纳达卡P3": 40,
                "尼赫鲁P1": 55,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 38
            },
            "4": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 25,
                "尤菲亚P3": 31,
                "纳达卡P1": 36,
                "纳达卡P2": 33,
                "纳达卡P3": 45,
                "尼赫鲁P1": 45,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 31
            },
            "5": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 25,
                "尤菲亚P3": 30,
                "纳达卡P1": 55,
                "纳达卡P2": 26,
                "纳达卡P3": 60,
                "尼赫鲁P1": 64,
                "尼赫鲁P2": 32,
                "尼赫鲁P3": 52
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 4.24, "电阻": 3.75 },
                "雷墨磁2": { "扭矩": 2.61, "电阻": 2.51 },
                "雷墨磁3": { "扭矩": 2.20, "电阻": 3.51 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 3.84, "电阻": 4.26 },
                "雷墨磁2": { "扭矩": 2.51, "电阻": 2.60 },
                "雷墨磁3": { "扭矩": 1.20, "电阻": 1.50 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 4.20, "电阻": 2.35 },
                "雷墨磁2": { "扭矩": 3.73, "电阻": 2.71 },
                "雷墨磁3": { "扭矩": 4.15, "电阻": 1.54 }
            }
        },
        "teamCoordinates": {
            "1": {
                "雷墨磁1": { "扭矩": 4.2, "电阻": 3.9, "目标市场": "尤1", "偏离度": 0.15 },
                "雷墨磁2": { "扭矩": 3.7, "电阻": 2.7, "目标市场": "尼2", "偏离度": 0.03 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.01 }
            },
            "2": {
                "雷墨磁1": { "扭矩": 4.4, "电阻": 3.8, "目标市场": "尤1", "偏离度": 0.16 },
                "雷墨磁2": { "扭矩": 2.5, "电阻": 2.3, "目标市场": "纳2", "偏离度": 0.23 },
                "雷墨磁3": { "扭矩": 1.9, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.30 }
            },
            "3": {
                "雷墨磁1": { "扭矩": 3.8, "电阻": 3.8, "目标市场": "纳1", "偏离度": 0.46 },
                "雷墨磁2": { "扭矩": 3.6, "电阻": 2.6, "目标市场": "尼2", "偏离度": 0.17 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.01 }
            },
            "4": {
                "雷墨磁1": { "扭矩": 4.2, "电阻": 2.4, "目标市场": "尼1", "偏离度": 0.05 },
                "雷墨磁2": { "扭矩": 2.6, "电阻": 2.5, "目标市场": "尤2", "偏离度": 0.01 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.01 }
            },
            "5": {
                "雷墨磁1": { "扭矩": 4.0, "电阻": 2.5, "目标市场": "无", "偏离度": null },
                "雷墨磁2": { "扭矩": 3.7, "电阻": 2.7, "目标市场": "纳2", "偏离度": 1.11 },
                "雷墨磁3": { "扭矩": 2.0, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.20 }
            }
        }
    },
    "3": {
        "period": "3",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 1182211,
                "尤菲亚2": 2326761,
                "尤菲亚3": 3712934,
                "纳达卡1": 1044261,
                "纳达卡2": 226423,
                "纳达卡3": 16349,
                "尼赫鲁1": 716406,
                "尼赫鲁2": 2022489,
                "尼赫鲁3": 105486
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 41.0,
                "尤菲亚2": 28.5,
                "尤菲亚3": 93.5,
                "纳达卡1": 38.6,
                "纳达卡2": 5.0,
                "纳达卡3": 0.7,
                "尼赫鲁1": 32.6,
                "尼赫鲁2": 52.6,
                "尼赫鲁3": 3.4
            },
            "平均行业毛利率": {
                "尤菲亚1": 28,
                "尤菲亚2": 49,
                "尤菲亚3": 24,
                "纳达卡1": 23,
                "纳达卡2": 40,
                "纳达卡3": 31,
                "尼赫鲁1": 37,
                "尼赫鲁2": 55,
                "尼赫鲁3": 29
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 9.37,
                "尤菲亚3": 17.09,
                "纳达卡1": 22.34,
                "纳达卡2": 12.94,
                "纳达卡3": 19.05,
                "尼赫鲁1": 26.43,
                "尼赫鲁2": 8.84,
                "尼赫鲁3": 16.52
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 28,
                "尤菲亚P2": 25,
                "尤菲亚P3": 21,
                "纳达卡P1": 22,
                "纳达卡P2": 14,
                "纳达卡P3": 32,
                "尼赫鲁P1": 15,
                "尼赫鲁P2": 25,
                "尼赫鲁P3": 19
            },
            "2": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 14,
                "尤菲亚P3": 24,
                "纳达卡P1": 22,
                "纳达卡P2": 24,
                "纳达卡P3": 19,
                "尼赫鲁P1": 1,
                "尼赫鲁P2": 29,
                "尼赫鲁P3": 8
            },
            "3": {
                "尤菲亚P1": 16,
                "尤菲亚P2": 14,
                "尤菲亚P3": 12,
                "纳达卡P1": 28,
                "纳达卡P2": 9,
                "纳达卡P3": 18,
                "尼赫鲁P1": 19,
                "尼赫鲁P2": 17,
                "尼赫鲁P3": 19
            },
            "4": {
                "尤菲亚P1": 13,
                "尤菲亚P2": 34,
                "尤菲亚P3": 29,
                "纳达卡P1": 24,
                "纳达卡P2": 52,
                "纳达卡P3": 19,
                "尼赫鲁P1": 26,
                "尼赫鲁P2": 6,
                "尼赫鲁P3": 36
            },
            "5": {
                "尤菲亚P1": 7,
                "尤菲亚P2": 12,
                "尤菲亚P3": 14,
                "纳达卡P1": 5,
                "纳达卡P2": 0,
                "纳达卡P3": 11,
                "尼赫鲁P1": 39,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 18
            }
        },
        "marketPricing": {
            "1": {
                "尤菲亚P1": 38,
                "尤菲亚P2": 21,
                "尤菲亚P3": 31,
                "纳达卡P1": 37,
                "纳达卡P2": 26,
                "纳达卡P3": 37,
                "尼赫鲁P1": 46,
                "尼赫鲁P2": 31,
                "尼赫鲁P3": 35
            },
            "2": {
                "尤菲亚P1": 32,
                "尤菲亚P2": 15,
                "尤菲亚P3": 27,
                "纳达卡P1": 40,
                "纳达卡P2": 20,
                "纳达卡P3": 36,
                "尼赫鲁P1": 45,
                "尼赫鲁P2": 17,
                "尼赫鲁P3": 32
            },
            "3": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 25,
                "尤菲亚P3": 30,
                "纳达卡P1": 39,
                "纳达卡P2": 27,
                "纳达卡P3": 40,
                "尼赫鲁P1": 45,
                "尼赫鲁P2": 30,
                "尼赫鲁P3": 38
            },
            "4": {
                "尤菲亚P1": 31,
                "尤菲亚P2": 19,
                "尤菲亚P3": 29,
                "纳达卡P1": 29,
                "纳达卡P2": 26,
                "纳达卡P3": 39,
                "尼赫鲁P1": 39,
                "尼赫鲁P2": 22,
                "尼赫鲁P3": 29
            },
            "5": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 25,
                "尤菲亚P3": 30,
                "纳达卡P1": 51,
                "纳达卡P2": 26,
                "纳达卡P3": 56,
                "尼赫鲁P1": 50,
                "尼赫鲁P2": 30,
                "尼赫鲁P3": 48
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 3.95, "电阻": 3.69 },
                "雷墨磁2": { "扭矩": 2.47, "电阻": 2.34 },
                "雷墨磁3": { "扭矩": 2.55, "电阻": 3.49 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 3.59, "电阻": 4.22 },
                "雷墨磁2": { "扭矩": 2.55, "电阻": 2.65 },
                "雷墨磁3": { "扭矩": 1.30, "电阻": 1.50 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 3.97, "电阻": 2.51 },
                "雷墨磁2": { "扭矩": 4.12, "电阻": 2.66 },
                "雷墨磁3": { "扭矩": 3.90, "电阻": 1.61 }
            }
        },
        "teamCoordinates": {
            "1": {
                "雷墨磁1": { "扭矩": 4.1, "电阻": 3.7, "目标市场": "尤1", "偏离度": 0.16 },
                "雷墨磁2": { "扭矩": 3.8, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.35 },
                "雷墨磁3": { "扭矩": 2.6, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "2": {
                "雷墨磁1": { "扭矩": 4.0, "电阻": 3.5, "目标市场": "尤1", "偏离度": 0.19 },
                "雷墨磁2": { "扭矩": 3.8, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.35 },
                "雷墨磁3": { "扭矩": 2.6, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "3": {
                "雷墨磁1": { "扭矩": 3.8, "电阻": 4.8, "目标市场": "纳1", "偏离度": 0.62 },
                "雷墨磁2": { "扭矩": 3.8, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.35 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.35 }
            },
            "4": {
                "雷墨磁1": { "扭矩": 3.6, "电阻": 3.7, "目标市场": "尤1", "偏离度": 0.35 },
                "雷墨磁2": { "扭矩": 3.8, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.35 },
                "雷墨磁3": { "扭矩": 2.6, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "5": {
                "雷墨磁1": { "扭矩": 4.0, "电阻": 2.5, "目标市场": "尼1", "偏离度": 0.03 },
                "雷墨磁2": { "扭矩": 3.8, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.35 },
                "雷墨磁3": { "扭矩": 2.6, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            }
        }
    },
    "4": {
        "period": "4",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 1054670,
                "尤菲亚2": 2264862,
                "尤菲亚3": 4143844,
                "纳达卡1": 1631277,
                "纳达卡2": 150950,
                "纳达卡3": 155398,
                "尼赫鲁1": 1317094,
                "尼赫鲁2": 3015995,
                "尼赫鲁3": 110300
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 32.0,
                "尤菲亚2": 44.7,
                "尤菲亚3": 115.6,
                "纳达卡1": 55.9,
                "纳达卡2": 4.0,
                "纳达卡3": 4.8,
                "尼赫鲁1": 49.4,
                "尼赫鲁2": 84.9,
                "尼赫鲁3": 3.6
            },
            "平均行业毛利率": {
                "尤菲亚1": 29,
                "尤菲亚2": 44,
                "尤菲亚3": 34,
                "纳达卡1": 27,
                "纳达卡2": 42,
                "纳达卡3": 33,
                "尼赫鲁1": 35,
                "尼赫鲁2": 65,
                "尼赫鲁3": 43
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 9.80,
                "尤菲亚3": 17.85,
                "纳达卡1": 22.34,
                "纳达卡2": 12.98,
                "纳达卡3": 19.05,
                "尼赫鲁1": 26.43,
                "尼赫鲁2": 9.59,
                "尼赫鲁3": 16.52
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 2,
                "尤菲亚P2": 30,
                "尤菲亚P3": 20,
                "纳达卡P1": 0,
                "纳达卡P2": 24,
                "纳达卡P3": 33,
                "尼赫鲁P1": 31,
                "尼赫鲁P2": 14,
                "尼赫鲁P3": 19
            },
            "2": {
                "尤菲亚P1": 31,
                "尤菲亚P2": 13,
                "尤菲亚P3": 25,
                "纳达卡P1": 38,
                "纳达卡P2": 24,
                "纳达卡P3": 11,
                "尼赫鲁P1": 1,
                "尼赫鲁P2": 16,
                "尼赫鲁P3": 9
            },
            "3": {
                "尤菲亚P1": 39,
                "尤菲亚P2": 14,
                "尤菲亚P3": 10,
                "纳达卡P1": 30,
                "纳达卡P2": 6,
                "纳达卡P3": 14,
                "尼赫鲁P1": 20,
                "尼赫鲁P2": 20,
                "尼赫鲁P3": 24
            },
            "4": {
                "尤菲亚P1": 20,
                "尤菲亚P2": 22,
                "尤菲亚P3": 25,
                "纳达卡P1": 15,
                "纳达卡P2": 33,
                "纳达卡P3": 26,
                "尼赫鲁P1": 17,
                "尼赫鲁P2": 26,
                "尼赫鲁P3": 36
            },
            "5": {
                "尤菲亚P1": 8,
                "尤菲亚P2": 20,
                "尤菲亚P3": 19,
                "纳达卡P1": 17,
                "纳达卡P2": 12,
                "纳达卡P3": 16,
                "尼赫鲁P1": 31,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 13
            }
        },
        "marketPricing": {
            "1": {
                "尤菲亚P1": 38,
                "尤菲亚P2": 24,
                "尤菲亚P3": 31,
                "纳达卡P1": 38,
                "纳达卡P2": 27,
                "纳达卡P3": 39,
                "尼赫鲁P1": 45,
                "尼赫鲁P2": 29,
                "尼赫鲁P3": 35
            },
            "2": {
                "尤菲亚P1": 34,
                "尤菲亚P2": 20,
                "尤菲亚P3": 29,
                "纳达卡P1": 41,
                "纳达卡P2": 26,
                "纳达卡P3": 38,
                "尼赫鲁P1": 39,
                "尼赫鲁P2": 30,
                "尼赫鲁P3": 35
            },
            "3": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 20,
                "尤菲亚P3": 30,
                "纳达卡P1": 41,
                "纳达卡P2": 22,
                "纳达卡P3": 35,
                "尼赫鲁P1": 46,
                "尼赫鲁P2": 31,
                "尼赫鲁P3": 35
            },
            "4": {
                "尤菲亚P1": 31,
                "尤菲亚P2": 19,
                "尤菲亚P3": 29,
                "纳达卡P1": 29,
                "纳达卡P2": 26,
                "纳达卡P3": 39,
                "尼赫鲁P1": 39,
                "尼赫鲁P2": 29,
                "尼赫鲁P3": 29
            },
            "5": {
                "尤菲亚P1": 40,
                "尤菲亚P2": 14,
                "尤菲亚P3": 29,
                "纳达卡P1": 51,
                "纳达卡P2": 31,
                "纳达卡P3": 56,
                "尼赫鲁P1": 50,
                "尼赫鲁P2": 30,
                "尼赫鲁P3": 48
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 3.71, "电阻": 3.63 },
                "雷墨磁2": { "扭矩": 2.55, "电阻": 2.43 },
                "雷墨磁3": { "扭矩": 2.90, "电阻": 3.51 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 3.35, "电阻": 4.13 },
                "雷墨磁2": { "扭矩": 2.51, "电阻": 2.70 },
                "雷墨磁3": { "扭矩": 1.40, "电阻": 1.49 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 4.01, "电阻": 2.66 },
                "雷墨磁2": { "扭矩": 4.25, "电阻": 2.70 },
                "雷墨磁3": { "扭矩": 3.65, "电阻": 1.68 }
            }
        },
        "teamCoordinates": {
            "1": {
                "雷墨磁1": { "扭矩": 4.1, "电阻": 3.7, "目标市场": "尤1", "偏离度": 0.39 },
                "雷墨磁2": { "扭矩": 2.6, "电阻": 2.5, "目标市场": "尤2", "偏离度": 0.08 },
                "雷墨磁3": { "扭矩": 2.9, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.01 }
            },
            "2": {
                "雷墨磁1": { "扭矩": 3.4, "电阻": 4.1, "目标市场": "纳1", "偏离度": 0.06 },
                "雷墨磁2": { "扭矩": 4.1, "电阻": 2.7, "目标市场": "尼2", "偏离度": 0.15 },
                "雷墨磁3": { "扭矩": 2.7, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.20 }
            },
            "3": {
                "雷墨磁1": { "扭矩": 3.4, "电阻": 4.2, "目标市场": "纳1", "偏离度": 0.09 },
                "雷墨磁2": { "扭矩": 4.5, "电阻": 2.7, "目标市场": "尼2", "偏离度": 0.25 },
                "雷墨磁3": { "扭矩": 2.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.70 }
            },
            "4": {
                "雷墨磁1": { "扭矩": 4.2, "电阻": 2.7, "目标市场": "尼1", "偏离度": 0.19 },
                "雷墨磁2": { "扭矩": 4.5, "电阻": 2.9, "目标市场": "尼2", "偏离度": 0.31 },
                "雷墨磁3": { "扭矩": 2.9, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.01 }
            },
            "5": {
                "雷墨磁1": { "扭矩": 4.3, "电阻": 2.7, "目标市场": "尼1", "偏离度": 0.29 },
                "雷墨磁2": { "扭矩": 4.4, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.17 },
                "雷墨磁3": { "扭矩": 2.9, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.01 }
            }
        }
    },
    "5": {
        "period": "5",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 769932,
                "尤菲亚2": 3096240,
                "尤菲亚3": 4201937,
                "纳达卡1": 1736825,
                "纳达卡2": 117638,
                "纳达卡3": 120805,
                "尼赫鲁1": 1812408,
                "尼赫鲁2": 4519632,
                "尼赫鲁3": 135328
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 28.0,
                "尤菲亚2": 64.5,
                "尤菲亚3": 123.6,
                "纳达卡1": 73.7,
                "纳达卡2": 2.6,
                "纳达卡3": 4.5,
                "尼赫鲁1": 73.5,
                "尼赫鲁2": 122.4,
                "尼赫鲁3": 4.3
            },
            "平均行业毛利率": {
                "尤菲亚1": 22,
                "尤菲亚2": 44,
                "尤菲亚3": 31,
                "纳达卡1": 33,
                "纳达卡2": 35,
                "纳达卡3": 29,
                "尼赫鲁1": 32,
                "尼赫鲁2": 53,
                "尼赫鲁3": 39
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 10.06,
                "尤菲亚3": 17.85,
                "纳达卡1": 24.25,
                "纳达卡2": 12.98,
                "纳达卡3": 23.56,
                "尼赫鲁1": 26.12,
                "尼赫鲁2": 10.84,
                "尼赫鲁3": 16.52
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 18,
                "尤菲亚P2": 41,
                "尤菲亚P3": 21,
                "纳达卡P1": 4,
                "纳达卡P2": 11,
                "纳达卡P3": 28,
                "尼赫鲁P1": 37,
                "尼赫鲁P2": 11,
                "尼赫鲁P3": 25
            },
            "2": {
                "尤菲亚P1": 22,
                "尤菲亚P2": 18,
                "尤菲亚P3": 24,
                "纳达卡P1": 43,
                "纳达卡P2": 33,
                "纳达卡P3": 19,
                "尼赫鲁P1": 7,
                "尼赫鲁P2": 22,
                "尼赫鲁P3": 18
            },
            "3": {
                "尤菲亚P1": 28,
                "尤菲亚P2": 14,
                "尤菲亚P3": 25,
                "纳达卡P1": 43,
                "纳达卡P2": 11,
                "纳达卡P3": 19,
                "尼赫鲁P1": 1,
                "尼赫鲁P2": 23,
                "尼赫鲁P3": 18
            },
            "4": {
                "尤菲亚P1": 23,
                "尤菲亚P2": 15,
                "尤菲亚P3": 12,
                "纳达卡P1": 11,
                "纳达卡P2": 39,
                "纳达卡P3": 20,
                "尼赫鲁P1": 32,
                "尼赫鲁P2": 23,
                "尼赫鲁P3": 26
            },
            "5": {
                "尤菲亚P1": 9,
                "尤菲亚P2": 12,
                "尤菲亚P3": 18,
                "纳达卡P1": 0,
                "纳达卡P2": 6,
                "纳达卡P3": 14,
                "尼赫鲁P1": 22,
                "尼赫鲁P2": 21,
                "尼赫鲁P3": 13
            }
        },
        "marketPricing": {
            "1": {
                "尤菲亚P1": 38,
                "尤菲亚P2": 22,
                "尤菲亚P3": 29,
                "纳达卡P1": 39,
                "纳达卡P2": 27,
                "纳达卡P3": 39,
                "尼赫鲁P1": 45,
                "尼赫鲁P2": 14,
                "尼赫鲁P3": 30
            },
            "2": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 23,
                "尤菲亚P3": 30,
                "纳达卡P1": 42,
                "纳达卡P2": 23,
                "纳达卡P3": 38,
                "尼赫鲁P1": 34,
                "尼赫鲁P2": 30,
                "尼赫鲁P3": 35
            },
            "3": {
                "尤菲亚P1": 37,
                "尤菲亚P2": 16,
                "尤菲亚P3": 28,
                "纳达卡P1": 45,
                "纳达卡P2": 25,
                "纳达卡P3": 35,
                "尼赫鲁P1": 49,
                "尼赫鲁P2": 30,
                "尼赫鲁P3": 35
            },
            "4": {
                "尤菲亚P1": 34,
                "尤菲亚P2": 19,
                "尤菲亚P3": 29,
                "纳达卡P1": 35,
                "纳达卡P2": 20,
                "纳达卡P3": 39,
                "尼赫鲁P1": 39,
                "尼赫鲁P2": 29,
                "尼赫鲁P3": 29
            },
            "5": {
                "尤菲亚P1": 31,
                "尤菲亚P2": 25,
                "尤菲亚P3": 32,
                "纳达卡P1": 48,
                "纳达卡P2": 26,
                "纳达卡P3": 35,
                "尼赫鲁P1": 50,
                "尼赫鲁P2": 30,
                "尼赫鲁P3": 35
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 3.46, "电阻": 3.54 },
                "雷墨磁2": { "扭矩": 2.65, "电阻": 2.56 },
                "雷墨磁3": { "扭矩": 3.25, "电阻": 3.50 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 3.10, "电阻": 4.02 },
                "雷墨磁2": { "扭矩": 2.49, "电阻": 2.75 },
                "雷墨磁3": { "扭矩": 1.50, "电阻": 1.51 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 3.94, "电阻": 2.81 },
                "雷墨磁2": { "扭矩": 4.34, "电阻": 2.82 },
                "雷墨磁3": { "扭矩": 3.40, "电阻": 1.75 }
            }
        },
        "teamCoordinates": {
            "1": {
                "雷墨磁1": { "扭矩": 4.1, "电阻": 2.7, "目标市场": "尼1", "偏离度": 0.20 },
                "雷墨磁2": { "扭矩": 2.7, "电阻": 2.6, "目标市场": "尤2", "偏离度": 0.06 },
                "雷墨磁3": { "扭矩": 3.3, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "2": {
                "雷墨磁1": { "扭矩": 3.1, "电阻": 4.0, "目标市场": "纳1", "偏离度": 0.02 },
                "雷墨磁2": { "扭矩": 4.2, "电阻": 2.7, "目标市场": "尼2", "偏离度": 0.19 },
                "雷墨磁3": { "扭矩": 3.2, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "3": {
                "雷墨磁1": { "扭矩": 3.4, "电阻": 4.1, "目标市场": "纳1", "偏离度": 0.31 },
                "雷墨磁2": { "扭矩": 4.3, "电阻": 2.8, "目标市场": "尼2", "偏离度": 0.05 },
                "雷墨磁3": { "扭矩": 3.3, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            },
            "4": {
                "雷墨磁1": { "扭矩": 4.0, "电阻": 2.7, "目标市场": "尼1", "偏离度": 0.13 },
                "雷墨磁2": { "扭矩": 4.3, "电阻": 2.7, "目标市场": "尼2", "偏离度": 0.13 },
                "雷墨磁3": { "扭矩": 2.9, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.35 }
            },
            "5": {
                "雷墨磁1": { "扭矩": 4.4, "电阻": 2.8, "目标市场": "尼1", "偏离度": 0.46 },
                "雷墨磁2": { "扭矩": 4.5, "电阻": 2.9, "目标市场": "尼2", "偏离度": 0.18 },
                "雷墨磁3": { "扭矩": 3.3, "电阻": 3.5, "目标市场": "尤3", "偏离度": 0.05 }
            }
        }
    }
};
