// 所有期间的数据
const DATA_STORAGE = {
    "1A": {
        "period": "1A",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 1673000,
                "尤菲亚2": 1012500,
                "尤菲亚3": 2020000,
                "纳达卡1": 1142400,
                "纳达卡2": 211500,
                "纳达卡3": 100800,
                "尼赫鲁1": 828000,
                "尼赫鲁2": 727650,
                "尼赫鲁3": 88200
            },
            "整个行业收入（百万）": {
                "尤菲亚1": null,
                "尤菲亚2": null,
                "尤菲亚3": null,
                "纳达卡1": null,
                "纳达卡2": null,
                "纳达卡3": null,
                "尼赫鲁1": null,
                "尼赫鲁2": null,
                "尼赫鲁3": null
            },
            "平均行业毛利率": {
                "尤菲亚1": null,
                "尤菲亚2": null,
                "尤菲亚3": null,
                "纳达卡1": null,
                "纳达卡2": null,
                "纳达卡3": null,
                "尼赫鲁1": null,
                "尼赫鲁2": null,
                "尼赫鲁3": null
            },
            "最低期末库存成本": {
                "尤菲亚1": null,
                "尤菲亚2": null,
                "尤菲亚3": null,
                "纳达卡1": null,
                "纳达卡2": null,
                "纳达卡3": null,
                "尼赫鲁1": null,
                "尼赫鲁2": null,
                "尼赫鲁3": null
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 27,
                "尤菲亚P2": 14,
                "尤菲亚P3": 20,
                "纳达卡P1": 26,
                "纳达卡P2": 14,
                "纳达卡P3": 20,
                "尼赫鲁P1": 15,
                "尼赫鲁P2": 27,
                "尼赫鲁P3": 19
            },
            "2": {
                "尤菲亚P1": 26,
                "尤菲亚P2": 22,
                "尤菲亚P3": 10,
                "纳达卡P1": 23,
                "纳达卡P2": 23,
                "纳达卡P3": 21,
                "尼赫鲁P1": 21,
                "尼赫鲁P2": 19,
                "尼赫鲁P3": 22
            },
            "3": {
                "尤菲亚P1": 24,
                "尤菲亚P2": 12,
                "尤菲亚P3": 20,
                "纳达卡P1": 26,
                "纳达卡P2": 12,
                "纳达卡P3": 20,
                "尼赫鲁P1": 15,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 19
            },
            "4": {
                "尤菲亚P1": 12,
                "尤菲亚P2": 29,
                "尤菲亚P3": 26,
                "纳达卡P1": 12,
                "纳达卡P2": 28,
                "纳达卡P3": 20,
                "尼赫鲁P1": 28,
                "尼赫鲁P2": 10,
                "尼赫鲁P3": 19
            },
            "5": {
                "尤菲亚P1": 12,
                "尤菲亚P2": 22,
                "尤菲亚P3": 25,
                "纳达卡P1": 14,
                "纳达卡P2": 23,
                "纳达卡P3": 20,
                "尼赫鲁P1": 21,
                "尼赫鲁P2": 19,
                "尼赫鲁P3": 19
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 4.36, "电阻": 3.77 },
                "雷墨磁2": { "扭矩": 2.46, "电阻": 2.32 },
                "雷墨磁3": { "扭矩": 1.85, "电阻": 3.50 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 4.03, "电阻": 4.29 },
                "雷墨磁2": { "扭矩": 2.57, "电阻": 2.55 },
                "雷墨磁3": { "扭矩": 1.10, "电阻": 1.51 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 4.07, "电阻": 2.20 },
                "雷墨磁2": { "扭矩": 3.52, "电阻": 2.58 },
                "雷墨磁3": { "扭矩": 4.40, "电阻": 1.47 }
            }
        }
    },
    "1B": {
        "period": "1B",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 2102310,
                "尤菲亚2": 1055700,
                "尤菲亚3": 2307820,
                "纳达卡1": 1201872,
                "纳达卡2": 213863,
                "纳达卡3": 91865,
                "尼赫鲁1": 409785,
                "尼赫鲁2": 725646,
                "尼赫鲁3": 68203
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 68.0,
                "尤菲亚2": 25.4,
                "尤菲亚3": 68.9,
                "纳达卡1": 42.1,
                "纳达卡2": 5.8,
                "纳达卡3": 3.6,
                "尼赫鲁1": 19.1,
                "尼赫鲁2": 20.1,
                "尼赫鲁3": 2.6
            },
            "平均行业毛利率": {
                "尤菲亚1": 29,
                "尤菲亚2": 41,
                "尤菲亚3": 22,
                "纳达卡1": 20,
                "纳达卡2": 29,
                "纳达卡3": 23,
                "尼赫鲁1": 36,
                "尼赫鲁2": 38,
                "尼赫鲁3": 28
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 11.20,
                "尤菲亚3": 17.85,
                "纳达卡1": 29.57,
                "纳达卡2": 14.78,
                "纳达卡3": 23.56,
                "尼赫鲁1": 26.43,
                "尼赫鲁2": 13.22,
                "尼赫鲁3": 21.06
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 24,
                "尤菲亚P2": 14,
                "尤菲亚P3": 19,
                "纳达卡P1": 28,
                "纳达卡P2": 14,
                "纳达卡P3": 23,
                "尼赫鲁P1": 23,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 23
            },
            "2": {
                "尤菲亚P1": 25,
                "尤菲亚P2": 23,
                "尤菲亚P3": 10,
                "纳达卡P1": 27,
                "纳达卡P2": 25,
                "纳达卡P3": 20,
                "尼赫鲁P1": 32,
                "尼赫鲁P2": 21,
                "尼赫鲁P3": 22
            },
            "3": {
                "尤菲亚P1": 28,
                "尤菲亚P2": 11,
                "尤菲亚P3": 22,
                "纳达卡P1": 30,
                "纳达卡P2": 12,
                "纳达卡P3": 22,
                "尼赫鲁P1": 23,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 23
            },
            "4": {
                "尤菲亚P1": 12,
                "尤菲亚P2": 29,
                "尤菲亚P3": 25,
                "纳达卡P1": 14,
                "纳达卡P2": 25,
                "纳达卡P3": 22,
                "尼赫鲁P1": 17,
                "尼赫鲁P2": 11,
                "尼赫鲁P3": 21
            },
            "5": {
                "尤菲亚P1": 11,
                "尤菲亚P2": 23,
                "尤菲亚P3": 25,
                "纳达卡P1": 2,
                "纳达卡P2": 24,
                "纳达卡P3": 13,
                "尼赫鲁P1": 5,
                "尼赫鲁P2": 19,
                "尼赫鲁P3": 11
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 4.36, "电阻": 3.77 },
                "雷墨磁2": { "扭矩": 2.46, "电阻": 2.32 },
                "雷墨磁3": { "扭矩": 1.85, "电阻": 3.50 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 4.03, "电阻": 4.29 },
                "雷墨磁2": { "扭矩": 2.57, "电阻": 2.55 },
                "雷墨磁3": { "扭矩": 1.10, "电阻": 1.49 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 4.07, "电阻": 2.20 },
                "雷墨磁2": { "扭矩": 3.52, "电阻": 2.58 },
                "雷墨磁3": { "扭矩": 4.40, "电阻": 1.47 }
            }
        }
    },
    "2": {
        "period": "2",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 1326849,
                "尤菲亚2": 1343565,
                "尤菲亚3": 2378884,
                "纳达卡1": 779711,
                "纳达卡2": 183455,
                "纳达卡3": 16758,
                "尼赫鲁1": 1255561,
                "尼赫鲁2": 983768,
                "尼赫鲁3": 70430
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 49.0,
                "尤菲亚2": 32.6,
                "尤菲亚3": 74.7,
                "纳达卡1": 31.0,
                "纳达卡2": 4.7,
                "纳达卡3": 0.7,
                "尼赫鲁1": 62.6,
                "尼赫鲁2": 29.2,
                "尼赫鲁3": 2.7
            },
            "平均行业毛利率": {
                "尤菲亚1": 37,
                "尤菲亚2": 57,
                "尤菲亚3": 28,
                "纳达卡1": 32,
                "纳达卡2": 44,
                "纳达卡3": 41,
                "尼赫鲁1": 45,
                "尼赫鲁2": 53,
                "尼赫鲁3": 37
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 9.22,
                "尤菲亚3": 16.91,
                "纳达卡1": 22.34,
                "纳达卡2": 13.12,
                "纳达卡3": 17.81,
                "尼赫鲁1": 26.43,
                "尼赫鲁2": 8.70,
                "尼赫鲁3": 19.49
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 24,
                "尤菲亚P2": 16,
                "尤菲亚P3": 25,
                "纳达卡P1": 33,
                "纳达卡P2": 14,
                "纳达卡P3": 37,
                "尼赫鲁P1": 16,
                "尼赫鲁P2": 27,
                "尼赫鲁P3": 23
            },
            "2": {
                "尤菲亚P1": 28,
                "尤菲亚P2": 19,
                "尤菲亚P3": 6,
                "纳达卡P1": 21,
                "纳达卡P2": 32,
                "纳达卡P3": 13,
                "尼赫鲁P1": 13,
                "尼赫鲁P2": 10,
                "尼赫鲁P3": 11
            },
            "3": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 3,
                "尤菲亚P3": 26,
                "纳达卡P1": 33,
                "纳达卡P2": 5,
                "纳达卡P3": 19,
                "尼赫鲁P1": 11,
                "尼赫鲁P2": 22,
                "尼赫鲁P3": 25
            },
            "4": {
                "尤菲亚P1": 5,
                "尤菲亚P2": 40,
                "尤菲亚P3": 29,
                "纳达卡P1": 10,
                "纳达卡P2": 41,
                "纳达卡P3": 19,
                "尼赫鲁P1": 35,
                "尼赫鲁P2": 7,
                "尼赫鲁P3": 28
            },
            "5": {
                "尤菲亚P1": 7,
                "尤菲亚P2": 22,
                "尤菲亚P3": 13,
                "纳达卡P1": 2,
                "纳达卡P2": 8,
                "纳达卡P3": 12,
                "尼赫鲁P1": 26,
                "尼赫鲁P2": 33,
                "尼赫鲁P3": 12
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 4.24, "电阻": 3.75 },
                "雷墨磁2": { "扭矩": 2.61, "电阻": 2.51 },
                "雷墨磁3": { "扭矩": 2.20, "电阻": 3.51 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 3.84, "电阻": 4.26 },
                "雷墨磁2": { "扭矩": 2.51, "电阻": 2.60 },
                "雷墨磁3": { "扭矩": 1.20, "电阻": 1.50 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 4.20, "电阻": 2.35 },
                "雷墨磁2": { "扭矩": 3.73, "电阻": 2.71 },
                "雷墨磁3": { "扭矩": 4.15, "电阻": 1.54 }
            }
        }
    },
    "3": {
        "period": "3",
        "industryData": {
            "整个行业订单": {
                "尤菲亚1": 1182211,
                "尤菲亚2": 2326761,
                "尤菲亚3": 3712934,
                "纳达卡1": 1044261,
                "纳达卡2": 226423,
                "纳达卡3": 16349,
                "尼赫鲁1": 716406,
                "尼赫鲁2": 2022489,
                "尼赫鲁3": 105486
            },
            "整个行业收入（百万）": {
                "尤菲亚1": 41.0,
                "尤菲亚2": 28.5,
                "尤菲亚3": 93.5,
                "纳达卡1": 38.6,
                "纳达卡2": 5.0,
                "纳达卡3": 0.7,
                "尼赫鲁1": 32.6,
                "尼赫鲁2": 52.6,
                "尼赫鲁3": 3.4
            },
            "平均行业毛利率": {
                "尤菲亚1": 28,
                "尤菲亚2": 49,
                "尤菲亚3": 24,
                "纳达卡1": 23,
                "纳达卡2": 40,
                "纳达卡3": 31,
                "尼赫鲁1": 37,
                "尼赫鲁2": 55,
                "尼赫鲁3": 29
            },
            "最低期末库存成本": {
                "尤菲亚1": 22.40,
                "尤菲亚2": 9.37,
                "尤菲亚3": 17.09,
                "纳达卡1": 22.34,
                "纳达卡2": 12.94,
                "纳达卡3": 19.05,
                "尼赫鲁1": 26.43,
                "尼赫鲁2": 8.84,
                "尼赫鲁3": 16.52
            }
        },
        "marketShare": {
            "1": {
                "尤菲亚P1": 28,
                "尤菲亚P2": 25,
                "尤菲亚P3": 21,
                "纳达卡P1": 22,
                "纳达卡P2": 14,
                "纳达卡P3": 32,
                "尼赫鲁P1": 15,
                "尼赫鲁P2": 25,
                "尼赫鲁P3": 19
            },
            "2": {
                "尤菲亚P1": 36,
                "尤菲亚P2": 14,
                "尤菲亚P3": 24,
                "纳达卡P1": 22,
                "纳达卡P2": 24,
                "纳达卡P3": 19,
                "尼赫鲁P1": 1,
                "尼赫鲁P2": 29,
                "尼赫鲁P3": 8
            },
            "3": {
                "尤菲亚P1": 16,
                "尤菲亚P2": 14,
                "尤菲亚P3": 12,
                "纳达卡P1": 28,
                "纳达卡P2": 9,
                "纳达卡P3": 18,
                "尼赫鲁P1": 19,
                "尼赫鲁P2": 17,
                "尼赫鲁P3": 19
            },
            "4": {
                "尤菲亚P1": 13,
                "尤菲亚P2": 34,
                "尤菲亚P3": 29,
                "纳达卡P1": 24,
                "纳达卡P2": 52,
                "纳达卡P3": 19,
                "尼赫鲁P1": 26,
                "尼赫鲁P2": 6,
                "尼赫鲁P3": 36
            },
            "5": {
                "尤菲亚P1": 7,
                "尤菲亚P2": 12,
                "尤菲亚P3": 14,
                "纳达卡P1": 5,
                "纳达卡P2": 0,
                "纳达卡P3": 11,
                "尼赫鲁P1": 39,
                "尼赫鲁P2": 24,
                "尼赫鲁P3": 18
            }
        },
        "marketIdealValues": {
            "尤菲亚": {
                "雷墨磁1": { "扭矩": 3.95, "电阻": 3.69 },
                "雷墨磁2": { "扭矩": 2.47, "电阻": 2.34 },
                "雷墨磁3": { "扭矩": 2.55, "电阻": 3.49 }
            },
            "纳达卡": {
                "雷墨磁1": { "扭矩": 3.59, "电阻": 4.22 },
                "雷墨磁2": { "扭矩": 2.55, "电阻": 2.65 },
                "雷墨磁3": { "扭矩": 1.30, "电阻": 1.50 }
            },
            "尼赫鲁": {
                "雷墨磁1": { "扭矩": 3.97, "电阻": 2.51 },
                "雷墨磁2": { "扭矩": 4.12, "电阻": 2.66 },
                "雷墨磁3": { "扭矩": 3.90, "电阻": 1.61 }
            }
        }
    }
};
